<a href="https://colab.research.google.com/github/biranchi2018/Misc/blob/master/1.Extracting%20HTML%20using%20Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
%%writefile test.html

<html>
<head>
  <meta http-equiv="Content-type" content="text/html;charset=UTF-8" />
</head>
<body>

<p>
<table border=1>
<caption align=left>Table 135</caption>
<tr bgcolor="#d4d0c8" bordercolor=black>
<th bordercolor=black>User Name</th>
<th bordercolor=black>Mobile Number</th>
</tr>
<tr bordercolor=black>
<td bordercolor=black bgcolor=white>John</td>
<td bordercolor=black bgcolor=white>1234567890</td>
</tr>
</table>
</p>

<p>
<table border=1>
<caption align=left>Table 246</caption>
<tr bgcolor="#d4d0c8" bordercolor=black>
<th bordercolor=black>Salary</th>
<th bordercolor=black>Experience</th>
</tr>6
<tr bordercolor=black>
<td bordercolor=black bgcolor=white>$5000</td>
<td bordercolor=black bgcolor=white>10</td>
</tr>
</table>
</p>

</body>
</html>

Writing test.html

In [2]:
import pandas as pd

In [12]:
df = pd.read_html("test.html", match='Table 246')

In [13]:
df

[  Salary  Experience
 0  $5000          10]

In [14]:
len(df)

1

In [15]:
df[0]

  Salary  Experience
0  $5000          10

In [17]:
# df[1]